/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "nov-page",
      "disabled": true,
      "settings": {}
    },
    "news_and_events_section_Y4DdeU": {
      "type": "news-and-events-section",
      "blocks": {
        "item_kTgJwT": {
          "type": "item",
          "settings": {
            "image": "shopify://shop_images/e87a5f63-dbe9-402c-b3dd-6cf88ba337c7.jpg",
            "date": "12/05/2025",
            "heading": "Bhima Jewellery Relaunches Its Trivandrum Flagship Showroom",
            "content": "<p>Bhima Jewellery Relaunches Its Trivandrum Flagship Showroom with Grandeur – Inaugurated by Cine Star Kajal Aggarwal<br/><br/>Trivandrum, 17 August 2025: Bhima Jewellery, India’s trusted name in purity, craftsmanship, and heritage for over a century, marked a spectacular new chapter today with the grand relaunch of its flagship showroom in Trivandrum. The much-awaited event was graced by leading cine artist Kajal Aggarwal, who inaugurated the revamped store amidst an enthusiastic and vibrant gathering of customers and well-wishers.<br/><br/><br/>The ceremony witnessed the presence of prominent members of the Bhima Jewellery leadership team, including Dr. B. Govindan (Chairman), Mr. M.S. Suhas (Managing Director), Ms. Jaya Govindan, Ms. Gayathri Suhas, Ms. Navya Suhas (Directors), and Ms. Aarthi Govindan.<br/><br/>The redesigned showroom offers an elevated luxury experience, blending Bhima’s timeless traditions with modern elegance. Spread across multiple levels, the flagship store showcases an extensive range of jewellery – from exquisite bridal collections, traditional Kerala designs, antique treasures, diamond masterpieces, Silver and contemporary lightweight pieces, to a special curated section for platinum and precious gemstones.<br/><br/>Speaking on the occasion, Chairman Dr B Govindan and Mr. Suhas MS  Managing Director, Bhima Jewellery, said:<br/><br/>“Trivandrum holds a special place in Bhima’s legacy. This flagship showroom is more than just a retail space – it’s a celebration of our 100-year journey of trust, purity, and artistry. With this relaunch, we are offering our customers not just jewellery, but a world-class shopping experience.”<br/><br/>Kajal Aggarwal, the guest of honour, shared her excitement:<br/><br/>“Bhima Jewellery has been a household name for generations. I’m delighted to be part of this beautiful milestone and witness the exceptional designs and craftsmanship that truly reflect India’s rich heritage.”<br/><br/>The relaunch also unveiled exclusive inaugural offers for customers, valid for a limited time, as a gesture of gratitude for the unwavering support of Trivandrum’s jewellery lovers.<br/></p>"
          }
        },
        "item_R9JTAC": {
          "type": "item",
          "settings": {
            "image": "shopify://shop_images/WhatsApp_Image_2025-12-16_at_5.51.42_PM.jpg",
            "date": "12/05/2025",
            "heading": "world record for 200 crore single day turnover",
            "content": "<p>Bhima Jewellery- marks its 100th anniversary, celebrating a legacy of purity and trust since 1925. For the first time in India in the field of jewellery a single day turnover fromTrivandrum district was around 200 crore business, is also a Guiness world record. Brand loyalty and customer faith helped to achieve such a World record and captured the top market share in South India. Bhima achieved Remarkable sale of over 250 kilograms of gold and diamond 400 carat in a single day from district wide - 3 Showrooms together - and its flagship showroom in Trivandrum, MG Road itself around 160 kilograms Gold and 320 carats Diamond sale, without spending anything on marketing activities, during its centenary celebrations. Dr. B Govindan, Chairman of the brand, highlighted the importance of adapting to changing times. \"While we cherish our heritage, we are also preparing for an exciting future. We are planning significant expansions across India and Other countries,-Worldwide - aiming to take our legacy of purity to a global audience\" Mr. Suhas MS, Managing Director of the brand said Reaching this milestone is a moment of immense pride and gratitude for us,\"*Our journey over the past 100 years has been guided by a singular focus on purity and trust, values that resonate deeply with our patrons. It is their unwavering support that has brought us to where we are today. Ms Gayatri Suhas, Director of the Brand, highlighted the integral part of the business - Strong Customer service and variety product selection. \"A century of trust is not the end of our journey; it's the beginning of an even more ambitious chapter. We are grateful to our customers, who are the real architects of this legacy, and we promise to continue upholding the values they cherish so deeply.\" On this centenary anniversary, Bhima acquired this record business without spending a single rupee on marketing activities. With the current fluctuating gold prices, consumers firmly believe that they need to invest in gold for their future. This record business is proof that customers deeply believe in Bhima and its values</p>"
          }
        },
        "item_adJAaR": {
          "type": "item",
          "settings": {
            "image": "shopify://shop_images/Screenshot_2025-12-16_173316.png",
            "date": "12/05/2025",
            "heading": "World record for the most diverse jewellery collection",
            "content": "<p>Bhima Jewellery Trivandrum holds the world record for the most diverse jewellery collection on Akshaya Tritiya. Christopher T Craft (USA), World Record Manager handed over the World record Certificate to Bhima Group Chairman Dr. B Govindan, Managing Director Suhas MS, Jaya Govindan and Gayatri Suhas.</p>"
          }
        },
        "item_CGdrrH": {
          "type": "item",
          "settings": {
            "image": "shopify://shop_images/Screenshot_2025-12-16_172513.png",
            "date": "12/05/2025",
            "heading": "Bhima brand-new venture—Celant Jewellery",
            "content": "<p>Grand inauguration of Bhima brand-new venture—Celant Jewellery . Inaugurated By Bhima Jewellery Director Navya Suhas. Bhima Jewellery Chairman Dr B Govindan , Managing Director Suhas MS , Directors Jaya Govindan and Gayatri Suhas were also Present. Celant Jewellery - Specially 18 Karat Light weight Designer Collections. Bhima built Celant Jewellery to bridge a gap in the market—offering daily-wear designer pieces that blend style, comfort, and affordability without compromising on quality or ethics. 18K gold jewellery for everyday glam, certified diamond collections for timeless sparkle, and vibrant gemstone pieces for a pop of color. There’s truly something for every occasion—casual, bridal, and statement designs included. The style at Celant is all about modern, lightweight designs—pieces you’ll want to wear all day, every day. From minimalist studs to bold cocktail rings, it’s elegance reimagined for today’s pace. Every piece is ethically sourced and certified. also join the Celant Premium Club for exclusive rewards, personalized services, and VIP events. If you’re in search of everyday elegance with a modern twist—visit Bhima new venture at Celant Jewellery at MG Road Showroom , Trivandrum. Also available at our online store www.Celant.in for latest and fashion designer collections.</p>"
          }
        }
      },
      "block_order": [
        "item_kTgJwT",
        "item_R9JTAC",
        "item_adJAaR",
        "item_CGdrrH"
      ],
      "name": "News & Events",
      "settings": {
        "heading": "Latest News & Events",
        "card_corner_radius": 10
      }
    }
  },
  "order": [
    "main",
    "news_and_events_section_Y4DdeU"
  ]
}
