/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "176336545984eca426": {
      "type": "_blocks",
      "blocks": {
        "ai_gen_block_9485901_NArLaa": {
          "type": "ai_gen_block_9485901",
          "settings": {
            "main_heading": "Our Story",
            "sub_heading": "Discover the journey behind our brand",
            "text_alignment": "center",
            "image": "shopify://shop_images/sdfsdfsdfsdfdsf.jpg",
            "image_max_width": 1200,
            "image_border_radius": 10,
            "image_bottom_spacing": 50,
            "content_heading_1": "THE BEGINNING",
            "content_text_1": "<p><br/>Dr. B. Govindan was born on 1st Jun 1944 as the 3rd son of late Sri. Bhima Bhattar, the founder father of Bhima Jewellery and Smt. Vanaja Bhima Bhattar at Alleppey, Kerala. He is a Commerce Graduate from S.D. College, Alleppey and has a Doctorate in Gemology from University of Colombo.</p>",
            "content_heading_2": "THE RISE",
            "content_text_2": "<p>Right from a young age, Dr.Govindan saw the gold market go through its many phases, from the period of gold control to the prosperous peaks in the market and along the way picked up precious pointers that would become invaluable later.</p><p>Joining the family business at the age of 18 as a Sales and Marketing Executive for Bhima & Brothers, Alleppey, Dr. B. Govindan is today the Chairman of Bhima Group, a Rs 4000 Crore worth company.</p><p>Bhima is essentially a family run concern, and Dr. B. Govindan has been instrumental in spearheading the growth of the company from a single outlet retail store to a multi-outlet organisation with outlets in Pan India & Middle East. Today it has many firsts and accomplishments under its belt.</p><p>His keen eye, quick business sense and perfectionist nature combined to give him an edge over the others in the market and emerge the market leader. Bhima has been one of the few businesses that has been passed down through generations over 100 years and has still managed to retain market leadership all through the years.</p>",
            "content_heading_3": "THE GOLDEN ERA",
            "content_text_3": "<p>The inimitable skill and acumen of Dr.Govindan in the business field and hispassion for the jewellery community as a whole led to him achieving many firsts in the field.</p><p>Bhima Jewellery bagged the first ISO-9001certified Jewellery in India in 2001. Bhima is the first BIS certified jewellery showroom in Kerala. It is the first jewellery store in Kerala which introduced the barcode system and rate card, which helps people know the right price of gold. It is also the first jewellery retail outlet to house an ATM in its premises. Bhima Jewellery is the highest VAT paying jeweller from a single outlet. It has been retaining its position of the Highest Sales Tax paying jewellery showroom award in the Kerala State for several years and also maintains the top position in the Grand Kerala Shopping Festival (GKSF), conducted by the Dept. of Tourism, Govt of Kerala.</p>",
            "content_heading_4": "A PEOPLE PERSON",
            "content_text_4": "<p>Dr Govindan has always understood the importance of people in the trade. He realised that the backbone of every business and a very major resource is its people. He has been instrumental in shaping the organisational hierarchy into a flatter pyramid structure. The 1000+ strong team of employees work towards achieving their goals and targets and report periodically to the management heads. The employees are given EP, ESI and free Medi-claim by the Management.</p><p>There is a contributory welfare fund of equal share of the employees and Management for the welfare of the employees. Free uniforms, food, lodging and conveyance are being provided. He is firm about bridging the gap between the employees and the management. He is also a staunch propagator of business with responsibility; he is the Trustee of Bhima Charities, which provides scholarship for the poor students of Kerala.</p><p>Always keeping his moral ground intact Dr Govindan continues to strive for the betterment of the consumers as well as the business . A fine example of this is the fact that he was one of the first promoters of the practice of detailing the consumer about the product and the importance of quality, a very good example of which was government certified hallmarking. The hallmarking awareness campaign, benefitted a lot of consumers, who are essentially laymen, and it helped cut down cheating significantly.</p>",
            "content_heading_5": "ACHIEVEMENTS AND ACCOLADES",
            "content_text_5": "<p>Dr Govindan has in-depth knowledge in the jewellery industry and has been placed in positions of importance several times, and continues to do so. He has a doctorate in Gemology from University of Colombo and is the President of All Kerala Gold & Silver Merchants Association in addition to being Vice-President of Trivandrum Chamber of Commerce and Industries, he also handles the position of Chairman of Gens & Jewellery Council South Zone and Chairman of the rate fixing Committee, Gold & Silver, Kerala. He is also a member of Governing Board of Directors of All India Gems & Jewellery Trade Federation and is a Government Approved Gold Valuer. He was the Jewellery Technical Advisory Committee Member of the Thirupathy Devasthanam from 1994 to 1999. He has received the Karmashreshta Award for 2012 and has also been honoured with the ‘Life Time Achievement Award’ organised by ‘The Art of Jewellery Magazine’. He has been awarded with “Life Time Achievement <br/>Award-2015” by British South India Council of Commerce (BSICC) by British Parliament.<br/><br/></p>",
            "content_heading_6": "BHIMA AND BEYOND",
            "content_text_6": "<p>Bhima has been one of the few businesses that has been passed down through generations over 90 years and has still managed to retain market leadership all through. In 2017, Bhima Jewellery won the Official Attempt to Guinness World Record for participating 2886 students in World’s Largest Physical Self Care Lesson on 26th July 2017 at Nishagandhi Auditorium Trivandrum Kerala as part of CSR activity in aspect to Bhima’s founder’s day Celebration.</p><p>Bhima has been nominated as one of the Best Five Retail Jewellers in the South for the Year 2014 by GJEPC. It is no wonder that the economic times voted Dr Govindan as one among the 6 top jewellers who controlled the gold trade in India (May of 2013). A Certificate of Appreciation was awarded to Dr. B. GovindanIn Recognition of the Exemplary Contribution, dedicated efforts and unstinted support extended towards the growth of the Gem and Jewellery Industry by GJF for 2013-15. Times Group of India Awarded him the Brand Icon of the Year 2016 for his most respected presence in the Jewellery Industry of Kerala and for creating a powerful legacy that has transformed Bhima into one of the top retail brands and changed the rules of Jewellery in the entire country.</p>",
            "content_heading_7": "",
            "content_text_7": "",
            "content_heading_8": "",
            "content_text_8": "",
            "content_heading_9": "",
            "content_text_9": "",
            "content_heading_10": "",
            "content_text_10": "",
            "content_max_width": 900,
            "content_alignment": "left",
            "content_item_spacing": 40,
            "container_width": 1400,
            "section_padding_top": 60,
            "section_padding_bottom": 60,
            "header_spacing": 40,
            "main_heading_size": 40,
            "main_heading_weight": "700",
            "sub_heading_size": 16,
            "sub_heading_weight": "400",
            "heading_gap": 15,
            "content_heading_size": 26,
            "content_heading_weight": "600",
            "content_text_size": 16,
            "content_text_gap": 20,
            "background_color": "#ffffff",
            "main_heading_color": "#1c1c1c",
            "sub_heading_color": "#666666",
            "content_heading_color": "#1c1c1c",
            "content_text_color": "#666666"
          },
          "blocks": {}
        }
      },
      "block_order": [
        "ai_gen_block_9485901_NArLaa"
      ],
      "settings": {}
    },
    "main": {
      "type": "nov-page",
      "disabled": true,
      "settings": {}
    }
  },
  "order": [
    "176336545984eca426",
    "main"
  ]
}
